[{"id": 1479195575312601088, "content": "@latimessports @BradyMcCollough He could’ve opted out if he didn’t want to play. Guys did it all over the country"}, {"id": 1479194061340909578, "content": "Your Mom's House Podcast w/ Andrew Tate - Ep.636 https://t.co/j9etHAg1lR via @YouTube"}, {"id": 1479187334436429825, "content": "@andrewtate_ @jagalight @WW_Marcus Judge Mental sounds like a British court tv show."}, {"id": 1479147393815916545, "content": "@joerogan get Andrew Tate on the podcast asap!"}, {"id": 1479120877652373514, "content": "@RedditCFB They should suspend the loser"}, {"id": 1479112652429266953, "content": "@XylieStarGaming Ayy Andrew tate funny dude rich as fuck 😂"}, {"id": 1479105484816728064, "content": "@davidgodson10 @panther_wakanda @jayythedope 💯 Their interview with Andrew Tate is a must-watch"}, {"id": 1479105443330879489, "content": "@OmoAlale @panther_wakanda @jayythedope 💯 Their interview with Andrew Tate is a must-watch"}, {"id": 1479062789318750213, "content": "@JackSlackMMA How about Andrew Tate’s appeals to sign up to his mailing list to become the ultimate alpha male?"}, {"id": 1479046033300676610, "content": "@GymRatCrypto John was acting like this with Andrew Tate. Starting chatting shit. Then they had a conversation. John stopped chatting shit he’s that kind of guy lol."}, {"id": 1478933070040477696, "content": "@SN_Ohio What legitimacy is this?"}, {"id": 1478916965213224961, "content": "@AliciaMarieBODY My aunt called me selfish for not wanting kids. To paraphrase Andrew Tate, \"Your ancestors survived being chased by sabertooth tigers &amp; all the crazy sh!t just so YOU can exist. And you're repaying them by ending their bloodline by not having kids!? Happiest people have kids!\""}, {"id": 1478844532091404288, "content": "I’m a few days late. I’ve been super busy. But I can finally listen to the #LostStories episode of #LetsNotMeet @letsnotmeetcast is a #podcast I always look forward to when I have downtime each week. #TrueHorror stories - go check it out! #AndrewTate https://t.co/PWA6p8eYHp"}, {"id": 1478832071804076036, "content": "@NFLonCBS The Jameis Winston of DBs"}, {"id": 1478812666214985729, "content": "@nick_mucci7 @andrewtate_ @MagicOhio @barstoolsports Don't bring the salt if you're not gonna drink the margarita. 🤷‍♂️"}, {"id": 1478758307225653253, "content": "@OriginalJakobe @andrewtate_ @MagicOhio @barstoolsports he blocked me after this tweet lol \nhttps://t.co/hQCqRRiEx8"}, {"id": 1478746927906893826, "content": "@andrewtate_ @nick_mucci7 @MagicOhio @barstoolsports Lol I didn't even say anything offensive. Dude just got made that his argument was without merit. https://t.co/awzNOZIN2e"}, {"id": 1478739159573483524, "content": "@OriginalJakobe @nick_mucci7 @MagicOhio @barstoolsports Fans have said for years “if this team was in the SEC they would lost 4 games a year”. Every year except for 2, the SEC has only had 1 team in the playoff. Bama has carried them in titles for the last 10 years. Other then that, it has been equally spread."}, {"id": 1478738961745031169, "content": "@andrewtate_ @nick_mucci7 @MagicOhio @barstoolsports Did ESPN also influence the absolute body bagging that the top two teams in the conference that we're oddly not allowed to include did to the supposed best teams from other conferences in the playoffs?"}, {"id": 1478737776006901766, "content": "@andrewtate_ @nick_mucci7 @MagicOhio @barstoolsports If the top tier teams from the SEC are in the Chip, would you not expect the #3-6 teams that are facing off against other conferences #1-3 teams to lose? Or are the mid tier teams expected to beat other conferences' top tier competition or else they're bad teams?"}, {"id": 1478735833247240193, "content": "@nick_mucci7 @andrewtate_ @MagicOhio @barstoolsports It's not a bias thing either. I *want* USC, Texas, Michigan, Penn St, Oregon to compete. They're just not doing the things required. Not recruiting at the same level, not building facilities, not hiring the right coaches. It took UGA 20 years to get to this point, put in the work"}, {"id": 1478734288497647618, "content": "@OriginalJakobe @andrewtate_ @MagicOhio @barstoolsports it's like they think joe burrow would take a team like nebraska or wisconsin to 15-0 national championship. there's levels to this"}, {"id": 1478733983903064064, "content": "@OriginalJakobe @andrewtate_ @MagicOhio @barstoolsports 😂\nthere's not one metric in which the SEC isn't significantly better than everyone else. imagine getting to play at indiana and purdue in  oct/nov instead of on the plains or in death valley. must be nice"}, {"id": 1478733884212891651, "content": "@andrewtate_ @nick_mucci7 @MagicOhio @barstoolsports I just don't find the \"if you take out all the good teams the SEC doesn't have any good teams\" argument very compelling at all."}, {"id": 1478732864426549250, "content": "@andrewtate_ @nick_mucci7 @MagicOhio @barstoolsports Look at the bowl record 👀 https://t.co/wdm1BSVlXj"}, {"id": 1478716579424649216, "content": "@andrewtate_ @MagicOhio @barstoolsports LSU, Auburn, Florida, Ole Miss, A&amp;M is a much better group of programs year after year than whatever the Big 10, 12, ACC, or PAC12 has to offer outside of their best team. It's not even close.And you can't call LSU an outlier when they play for championship every 5 years."}, {"id": 1478699262007468035, "content": "@MartinWhite78 Halo! please find the unroll here: Hint: Andrew Tate admits being connected to Romanian mafia BOY ITD… https://t.co/9aQOrx7vcF Talk to you soon. 🤖"}, {"id": 1478576765635371015, "content": "@MagicOhio @andrewtate_ @barstoolsports SEC is literally just Georgia and Alabama at this point. Every now and then you get a good Florida or LSU team but that’s it."}, {"id": 1478571737277161474, "content": "@andrewtate_ @MagicOhio @barstoolsports LSU has won 3 championships and played for four over the last 20 years. Florida has two. Auburn has one (played for two). Georgia contends every year. If the SEC is top heavy, no one else is any kind of heavy"}, {"id": 1478567811010428933, "content": "@andrewtate_ @MagicOhio @barstoolsports Facts"}, {"id": 1478566175625908225, "content": "@barstoolsports Bowl season says otherwise"}, {"id": 1478477672997081091, "content": "@ManUtd just has a toxic fan base, players are scared."}, {"id": 1478477073085833228, "content": "@Akademiks Like what Andrew Tate has been saying “RESIST THE SLAVE MIND”"}, {"id": 1478471444833071105, "content": "I enjoy an entertaining grifter, but Andrew Tate still trying to claim crypto Alpha status is a bit too cringe. He was shilling $cake when it was in the 20s 😭😭😭😭"}, {"id": 1478468990162939905, "content": "@ColmMcGuigan P JONES THE ONLY MAN WHO LOOKED ONIT!!! 👀"}, {"id": 1478358427227377664, "content": "@PersuasionRisng @ScottAdamsSays Who is Andrew Tate?"}, {"id": 1478304794276151297, "content": "@mistrfinance Finance, future of finance, life lessons &amp; mindset, building companies, investing in different assets, asset allocation.\nWith Andrew Tate, Michael Pilarczyk, Sonuha, and other interesting people in your ⭕️"}, {"id": 1478220855964737540, "content": "@andrewtate_ @CooBeeanz @RuiterWrongFAN Umm  low ass trajectory of his balls,… staring his receiver down… pretty obvious actually"}, {"id": 1478220422357438466, "content": "@andrewtate_ @CooBeeanz @RuiterWrongFAN Batted balls is his fault tho"}, {"id": 1478219385609281539, "content": "@CLE_SPORTS_FANS DT or WR. Amazing wideouts coming out next year. Not to mention our DL has been blown off the ball all season"}, {"id": 1478214087561687043, "content": "@CooBeeanz @RuiterWrongFAN Sometimes it is, not those instances"}, {"id": 1478196161118756864, "content": "@hamdiqalif82 @nrlasyikin_ Andrew tate"}, {"id": 1478184992689823747, "content": "NOT ANOTHER SHOE"}, {"id": 1478165086191583235, "content": "@ChristinaP @tomsegura please have #andrewtate on frequently.  What a wild, fun ride. #cobra"}, {"id": 1478124488072089601, "content": "Your Mom's House Podcast w/ Andrew Tate - Ep.636 https://t.co/NURVcAA6QE via @YouTube"}, {"id": 1478108491407573001, "content": "Your Mom's House Podcast w/ Andrew Tate - Ep.636 https://t.co/LV0zbB89uB via @YouTube\n\nPOINTS WERE MADE"}, {"id": 1478086482078359552, "content": "#RONALDOOUT useless now ‘ I said what I said’ #MUFC"}, {"id": 1478085142338064386, "content": "@StevoTheMadMan Say what ? 🥲🥲🥲🥲🥲"}, {"id": 1478085063338246149, "content": "GLOR GLORY WHAT A LOAD OF …. 💩 💩💩💩💩💩💩💩💩💩💩💩💩💩💩 #ManchesterUnited #ManUnited #MUFC"}, {"id": 1478084623896911879, "content": "@GNev2 Never is GARY"}, {"id": 1478083713061867524, "content": "Can’t believe I always look forward to watching my team and this is what I get… So fucking shit. I’m turning this off I don’t even wanna see extra time. #ManchesterUnited"}, {"id": 1478083156372819970, "content": "This team has been depressing me like the pandemic #ManchesterUnited 💩 #muwol"}, {"id": 1478081842045763591, "content": "WE ARE SOOO SHIT @ManUtd #MUFC #MUWV"}, {"id": 1478076210022428674, "content": "#rangnickout man just took @masongreenwood off #MUNWOL"}, {"id": 1478075263011414018, "content": "If @Sanchooo10 is £70mill then @masongreenwood is £100mill!!  #MUFC #MUNWOL"}, {"id": 1478074471357554695, "content": "Such ugly boring football. 😔 #mufc #MUNWOL"}, {"id": 1478068417609490434, "content": "Phil Jones showing @HarryMaguire93 how it’s done . #MUNWOL"}, {"id": 1478063975367467012, "content": "@Forex20747753 @9ZEROESS @elonmusk @cript_dogezilla Nice😀"}, {"id": 1478063770404593672, "content": "I don’t know what all this hype about Scott McTominay is all about… He isn’t consistent, look how shit he’s playing tonight #MUNWOL #MUFC"}, {"id": 1478060753890557960, "content": "Big up Phil Jones! I am glad he’s back, this will demonstrate how shit Harry Maguire is #MUNWOL #mufc #PHILJONES"}, {"id": 1478057566445969410, "content": "“A Man who lacks purpose distracts himself with pleasure” #andrewtate #rationalmale #tatespeech #redpill #kevinsamuels #masculinity #jesseleepeterson https://t.co/8avpIBwgAc"}, {"id": 1478037330845917189, "content": "mental clarity is a performance enhancing drug\n\nー andrew tate"}, {"id": 1477990008732618754, "content": "@WidasSatyo Jadi inget kata2 Andrew Tate seorang western kickboxer.\n\"If you're tolerant of everything, then you stand for nothing\""}, {"id": 1477854653979107328, "content": "... but I am not so foolish to mistake a TRAINED 🐉\n\nfor a TAMED one.\n\nIt is a NeverEnding Responsibility to ALWAYS be her 🔥⚪️🔥\n\nTHIS is what I teach inside The War Room of Andrew Tate @MasterfulPo \n\nLearn my secrets.\n\n2/\n\nhttps://t.co/Js5rWrms9d"}, {"id": 1477841238078459904, "content": "@bowtiedblackbat @BowTiedV Check out Andrew tate. Apparently she DMed him"}, {"id": 1477785969533210625, "content": "This is rare from a kick boxer and  #bitcoin supporter Andrew Tate https://t.co/f2tbzZWNcX"}, {"id": 1477770458648952833, "content": "@andrewtate_ @riversmccown His career is officially ruined. 🔥 🔥"}, {"id": 1477756712182554624, "content": "@MCunninghamAJC @andrewtate_ @riversmccown He just blew his last chance to play in the NFL.  His career is as good as over.  Hope he saved his money.  What a wasted talent.  He needs help."}, {"id": 1477745624623714304, "content": "@andrewtate_ @riversmccown ruining? it's over after that.  How many chances does the nutbar get?"}, {"id": 1477742794387116034, "content": "@smEllenOSU @riversmccown Yeah, I mean at this point he had an opportunity, but he literally just left it on the field."}, {"id": 1477735155846500360, "content": "@jagalight @WW_Marcus I don’t think it’s judge mental man. It’s just the truth. Look at all the buckeyes who have come out against what he said? Poor guy is going to get his 15 minutes for this then be done."}, {"id": 1477734893857779717, "content": "@riversmccown People will laugh at this and give him props for standing up for himself, but this is ruining his career."}, {"id": 1477729931165503488, "content": "@andrewtate_ @WW_Marcus Not sure that’s the kind of judgmental response that Jesus would tweet."}, {"id": 1477711612731609090, "content": "@alpharivelino His wife is facing four-time world kickboxing champion Andrew Tate though"}, {"id": 1477597734093967362, "content": "Beginning of a new year I used to think...\n\n\"This year it's going to be different.I'm going to achieve X.\"\n\nThen I logged on social media and got distracted. \n\nBought bullshit courses. \n\nGot scammed by Andrew Tate. \n\nBut last year WAS different because I stopped Social Media."}, {"id": 1477564823495864322, "content": "Dumb shit, leads to dumb shit. - Andrew Tate"}, {"id": 1477488229792337921, "content": "@TheWoosterHook @WW_Marcus Every team on earth has players that have the same narrative. Things don’t work out, they blame other people and they are forgotten. He will make noise for a few days, but no one will remember him a year or two from now. I hope the best for him"}, {"id": 1477487282802335744, "content": "@andrewtate_ @WW_Marcus So weak, Tater. Sorry that little one inherits your privilege."}, {"id": 1477476120698277890, "content": "@mikegolicjr All those other players and coaches helped him get there. He wouldn’t be there without them. He definitely owes them"}, {"id": 1477470602097270785, "content": "@WW_Marcus Every quitter blames other people"}, {"id": 1477457671607488513, "content": "@CoachLaVonne Incredible game management by Day. Stayed consistent and stayed true to his offense the whole game. Eventually established the run too"}, {"id": 1477424804265345026, "content": "The podcast with Andrew Tate on @YMHstudios was by far the best podcast of 2021 😂😂 @tomsegura @ChristinaP"}, {"id": 1477419217595117569, "content": "@MarcGivler Probably watched the game and realized he could start day 1"}, {"id": 1477416070692618240, "content": "@andrewtate_ I mean utah is solid tho, they definitely are scrubs but we better then this man"}, {"id": 1477415017976934403, "content": "@Ralph_Turner69 We are missing like 9 starters dude. I mean I’m frustrated too but we don’t need to fire our coach lol"}, {"id": 1477414732382580736, "content": "@andrewtate_ Bruh it’s utah 🤣, they are not like that it should be 7-0 at the worst right now"}, {"id": 1477414576115310601, "content": "@Ralph_Turner69 Idk what he can do about bad throws and snaps/penalties. They’ve only had three possessions."}, {"id": 1477414353972383744, "content": "@andrewtate_ Well he ain’t showing it right now this lax conservative bs"}, {"id": 1477414221205934084, "content": "@Ralph_Turner69 I mean he made the changes to his staff that he needed too. He lost a close game to Oregon with a bunch of 18 year olds and made changes and the defense was solid all year until the last game. He’s a top 5 coach in CFB"}, {"id": 1477413808079577089, "content": "@Jeff_Baran @BarstoolU @UnnecRoughness Trever Lawerence’s contract isn’t even that much and he was the first overall player taken and a QB. Regardless teams pay players based on their market for the position. Pay better attention buddy"}, {"id": 1477413410212093958, "content": "@andrewtate_ Ok maybe not fire him but he just doesn’t approach stuff well he seems to lax"}, {"id": 1477412545531109379, "content": "@andrewtate_ Stroud is suspect too 🤷🏿‍♂️"}, {"id": 1477412421031579654, "content": "@Ralph_Turner69 Blaming Ryan day is ridiculous. Their offense was the number one offense this year. They have a new defensive coordinator starting tomorrow. This is the only year he didn’t make the playoffs and he’s had first year starters all season."}, {"id": 1477411442106290180, "content": "@andrewtate_ I’m not hearing that bro they had all year to make@something shake it’s freaking utah"}, {"id": 1477411294986874885, "content": "@Ralph_Turner69 His best players all opted out. There are rumors he could leave for the NFL. OSU has had first year starters all over the place all season. They just don’t have any experience"}, {"id": 1477411026232655873, "content": "@andrewtate_ Get him out of here bro it’s still the same bs"}, {"id": 1477396058674237443, "content": "This was a fantastic podcast. Andrew Tate seems to be a super smart guy. Honestly highly recommend \n\nYour Mom's House Podcast w/ Andrew Tate - Ep.636 https://t.co/AXcHbV9r1M via @YouTube"}, {"id": 1477385490609356803, "content": "Andrew Tate is actually pure comedy. \n\nThe dude is the definition of based"}, {"id": 1477385238691160078, "content": "@Jeff_Baran @BarstoolU @UnnecRoughness Also wrong. Rookie contracts are never that much unless they are for quarterbacks. The only reason he didn’t get that $ from his big contract is because he had bad seasons and they didn’t want to pay him. His fault, not the bowl game’s."}, {"id": 1477380236954284040, "content": "@andrewtate_ @BarstoolU @UnnecRoughness He's only made $30M in his career which is less than what he would've been guaranteed on high first round pick on a rookie contract. Then he could have also had a second contract. But keep that college football peddling going."}, {"id": 1477379711491887108, "content": "I like Art, Nature &amp; Beauty.\n\nBut Andrew Tate is the master of HIS genre. \n\nWarrior - Multimillionaire - Maverick - World Champion - Philosopher.\n\nYou don't like him because you think he's 'bad' or a b*stard; that's your hang-up.\n\nHere is 'small bets' + OODA."}, {"id": 1477375896873021441, "content": "@Jeff_Baran @BarstoolU @UnnecRoughness After his injury he made the pro bowl and signed a 60 million dollar contract in 2019. He turned out just fine."}, {"id": 1477374134724308995, "content": "@andrewtate_ @BarstoolU @UnnecRoughness Ah, yes. Risk your livelihood for one meaningless game. I bet Jaylon Smith wishes he hadn't played."}, {"id": 1477373796101337092, "content": "@Somethin2BlazeU @CNN Dude, I identify as Andrew Tate"}, {"id": 1477369772816080896, "content": "@AlmightySnowsa somebody knows about andrew tate"}, {"id": 1477364994555609092, "content": "@NotHabermas @callicrates_ All good! Andrew Tate was funny as fuck on this “mainstream” comedy YT show https://t.co/TTtJGXiiLj\n\nYou can see in comments he killed it a 99% new audience \n\nhe posts it saying “watch it before\nit gets banned”\n\nIt’s\nnot an idle threat-\nYT has taken down far more tame shit"}, {"id": 1477360372038389765, "content": "Andrew Tate Net Worth 2022: Age, Height, Weight, Girlfriend, Dating, Kids, Bio-Wiki https://t.co/sf5HeOuvbI"}, {"id": 1477352104780083200, "content": "@BarstoolU @UnnecRoughness Say it louder for the people in the back"}, {"id": 1477352007925219338, "content": "He’s so right. People love being football players, not playing football"}, {"id": 1477322145101398026, "content": "@ESPNCFB How has this not been deleted yet ?"}, {"id": 1477319977493577732, "content": "Start 2022 BIG. You got pretty much everything you need to learn about life on this podcast with the one and only  @MasterfulPo \n\nYour Mom's House Podcast w/ Andrew Tate - Ep.636\nhttps://t.co/v65wgMix7r"}, {"id": 1477235406395564033, "content": "Imagine finding the absolutely generic red pill stuff and lies spouted by Andrew Tate and thinking \"Wow I must join the War Room\" and finding out...It's all a scam."}, {"id": 1477170897509392386, "content": "Aint that andrew tate?"}, {"id": 1477127259785887746, "content": "@DOGEZILLACOIN Let's Gooo🚀"}, {"id": 1477109987235172355, "content": "@YMHstudios Andrew Tate is the dumbest podcast guest you’ve ever had"}, {"id": 1477089856635678720, "content": "Andrew Tate got kissy replies outta your wife -- entirely by chance."}]